#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.amazon_ami: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_iam_policy_document.assume_role: Reading...
module.vpc.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=us-east-2]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-0ec5c7d8262c1f6b2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_autoscaling_attachment.attach-app will be created
  + resource "aws_autoscaling_attachment" "attach-app" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # aws_autoscaling_group.application will be created
  + resource "aws_autoscaling_group" "application" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 480
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 6
      + metrics_granularity              = "1Minute"
      + min_size                         = 3
      + name                             = "app-3"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_refresh {
          + strategy = "Rolling"
          + triggers = [
              + "launch_template",
            ]

          + preferences {
              + min_healthy_percentage       = 50
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = true
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app-3"
        }
      + tag {
          + key                 = "Source"
          + propagate_at_launch = true
          + value               = "https://github.com/kunduso/add-asg-elb-terraform"
        }

      + traffic_source (known after apply)
    }

  # aws_autoscaling_policy.asg_policy_down will be created
  + resource "aws_autoscaling_policy" "asg_policy_down" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "app-3"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "app-3-asg-policy-down"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # aws_autoscaling_policy.asg_policy_up will be created
  + resource "aws_autoscaling_policy" "asg_policy_up" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "app-3"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "app-3-asg-policy-up"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # aws_cloudwatch_metric_alarm.asg_cpu_alarm_down will be created
  + resource "aws_cloudwatch_metric_alarm" "asg_cpu_alarm_down" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ec2 cpu utilization"
      + alarm_name                            = "app-3-asg-cpu-alarm-down"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "app-3"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + threshold                             = 30
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.asg_cpu_alarm_up will be created
  + resource "aws_cloudwatch_metric_alarm" "asg_cpu_alarm_up" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ec2 cpu utilization"
      + alarm_name                            = "app-3-asg-cpu-alarm-up"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "app-3"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + threshold                             = 70
      + treat_missing_data                    = "missing"
    }

  # aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "app-3-ec2-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "app-3-ec2-role"
      + tags_all    = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-3-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.custom will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "app-3-ec2-role"
    }

  # aws_launch_template.application will be created
  + resource "aws_launch_template" "application" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0ec5c7d8262c1f6b2"
      + instance_type   = "t3.medium"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags_all        = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + user_data       = "IyEvYmluL2Jhc2gKCiMgSW5zdGFsbCBhbmQgdXBkYXRlIHBhY2thZ2VzCmFtYXpvbi1saW51eC1leHRyYXMgaW5zdGFsbCBlcGVsIC15Cnl1bSB1cGRhdGUgLXkKeXVtIGluc3RhbGwgc3RyZXNzIC15Cnl1bSBpbnN0YWxsIC15IGh0dHBkLng4Nl82NAoKIyBHZXQgSU1EU3YyIHRva2VuICh2YWxpZCBmb3IgNiBob3VycyAvIDIxNjAwIHNlY29uZHMpClRPS0VOPWBjdXJsIC1YIFBVVCAiaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvYXBpL3Rva2VuIiAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuLXR0bC1zZWNvbmRzOiAyMTYwMCJgCgojIFVzZSB0aGUgdG9rZW4gdG8gZ2V0IGF2YWlsYWJpbGl0eSB6b25lIGluZm9ybWF0aW9uClJFR0lPTl9BVl9aT05FPWBjdXJsIC1zIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL3BsYWNlbWVudC9hdmFpbGFiaWxpdHktem9uZWAKCiMgU3RhcnQgYW5kIGVuYWJsZSBIVFRQIHNlcnZpY2UKc3lzdGVtY3RsIHN0YXJ0IGh0dHBkLnNlcnZpY2UKc3lzdGVtY3RsIGVuYWJsZSBodHRwZC5zZXJ2aWNlCgojIENyZWF0ZSB0aGUgd2ViIHBhZ2Ugd2l0aCBpbnN0YW5jZSBpbmZvcm1hdGlvbgplY2hvICJIZWxsbyBXb3JsZCBmcm9tICQoaG9zdG5hbWUgLWYpIGZyb20gdGhlIGF2YWlsYWJpbGl0eSB6b25lOiAkUkVHSU9OX0FWX1pPTkUiID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCg=="

      + iam_instance_profile {
          + name = "app-3-ec2-profile"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + network_interfaces {
          + security_groups = (known after apply)
        }
    }

  # aws_lb.front will be created
  + resource "aws_lb" "front" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "app-3"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags_all                                                     = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.front_end will be created
  + resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.front will be created
  + resource "aws_lb_target_group" "front" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "app-3-front"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_health_state (known after apply)
    }

  # aws_security_group.asg_lb_security_group will be created
  + resource "aws_security_group" "asg_lb_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbound traffic to load balancer from the internet."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app-3-ASG-LB-SG-IN"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-3-asg-lb-sg"
        }
      + tags_all               = {
          + "Name"   = "app-3-asg-lb-sg"
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ec2_security_group will be created
  + resource "aws_security_group" "ec2_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbound traffic to EC2 instances from load balancer security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app-3-Instance-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-3-instance-sg"
        }
      + tags_all               = {
          + "Name"   = "app-3-instance-sg"
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.egress_ec2 will be created
  + resource "aws_security_group_rule" "egress_ec2" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "allow traffic to the load balancer"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.egress_load_balancer will be created
  + resource "aws_security_group_rule" "egress_load_balancer" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow traffic to reach outside the vpc."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress_ec2 will be created
  + resource "aws_security_group_rule" "ingress_ec2" {
      + description              = "allow traffic from the load balancer"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_load_balancer will be created
  + resource "aws_security_group_rule" "ingress_load_balancer" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow traffic into the load balancer from the internet."
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_flow_log_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.vpc.aws_cloudwatch_log_group.network_flow_logging[0] will be created
  + resource "aws_cloudwatch_log_group" "network_flow_logging" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "app-3-flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"   = "app-3-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all          = {
          + "Name"   = "app-3-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"   = "app-3-default"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all               = {
          + "Name"   = "app-3-default"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat_gateway[0] will be created
  + resource "aws_eip" "nat_gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"   = "app-3-nat-eip-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all             = {
          + "Name"   = "app-3-nat-eip-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat_gateway[1] will be created
  + resource "aws_eip" "nat_gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"   = "app-3-nat-eip-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all             = {
          + "Name"   = "app-3-nat-eip-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat_gateway[2] will be created
  + resource "aws_eip" "nat_gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"   = "app-3-nat-eip-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all             = {
          + "Name"   = "app-3-nat-eip-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_flow_log.network_flow_logging[0] will be created
  + resource "aws_flow_log" "network_flow_logging" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name"   = "app-3-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                 = {
          + "Name"   = "app-3-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_role.vpc_flow_log_role[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-3-vpc-flow-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"   = "app-3-vpc-flow-role"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all              = {
          + "Name"   = "app-3-vpc-flow-role"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpc.aws_iam_role_policy.vpc_flow_log_role_policy[0] will be created
  + resource "aws_iam_role_policy" "vpc_flow_log_role_policy" {
      + id          = (known after apply)
      + name        = "app-3-vpc-flow-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this_igw[0] will be created
  + resource "aws_internet_gateway" "this_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"   = "app-3-gateway"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all = {
          + "Name"   = "app-3-gateway"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_kms_alias.key[0] will be created
  + resource "aws_kms_alias" "key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/app-3-encrypt-flow-log"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.vpc.aws_kms_key.custom_kms_key[0] will be created
  + resource "aws_kms_key" "custom_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for app-3"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Name"   = "app-3-encryption-key"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                           = {
          + "Name"   = "app-3-encryption-key"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_kms_key_policy.encrypt_log[0] will be created
  + resource "aws_kms_key_policy" "encrypt_log" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "app-3-flow-log-encryption"
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::743794601996:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncryptFrom",
                          + "kms:ReEncryptTo",
                          + "kms:GenerateDataKey",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "kms:EncryptionContext:aws:logs:arn" = [
                                  + "arn:aws:logs:us-east-2:743794601996:log-group:app-3-flow-logs",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowCloudWatchLogsEncryption"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.vpc.aws_nat_gateway.public[0] will be created
  + resource "aws_nat_gateway" "public" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"   = "app-3-nat-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                           = {
          + "Name"   = "app-3-nat-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_nat_gateway.public[1] will be created
  + resource "aws_nat_gateway" "public" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"   = "app-3-nat-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                           = {
          + "Name"   = "app-3-nat-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_nat_gateway.public[2] will be created
  + resource "aws_nat_gateway" "public" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"   = "app-3-nat-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                           = {
          + "Name"   = "app-3-nat-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_route.internet_route[0] will be created
  + resource "aws_route" "internet_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.private_route[0] will be created
  + resource "aws_route" "private_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.private_route[1] will be created
  + resource "aws_route" "private_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.private_route[2] will be created
  + resource "aws_route" "private_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"   = "app-3-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all         = {
          + "Name"   = "app-3-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"   = "app-3-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all         = {
          + "Name"   = "app-3-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"   = "app-3-private-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all         = {
          + "Name"   = "app-3-private-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"   = "app-3-public"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all         = {
          + "Name"   = "app-3-public"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.30.0/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-3-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-3-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.30.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-3-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-3-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.30.64/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-3-private-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-3-private-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.30.96/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-3-public-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-3-public-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.30.128/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-3-public-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-3-public-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.30.160/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-3-public-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-3-public-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.20.30.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"   = "app-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                             = {
          + "Name"   = "app-3"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

Plan: 55 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_endpoint = (known after apply)

Warning: 'launch_template' always triggers an instance refresh and can be removed

  with aws_autoscaling_group.application,
  on autoscaling.tf line 54, in resource "aws_autoscaling_group" "application":
  54:     triggers = ["launch_template"]

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*